[
  {
    "name": "LetterBox",
    "link": "https://github.com/0xfarco/letterbox",
    "description": "A cloud-native newsletter application built with Rust, Actix Web, and PostgreSQL. The project includes a subscription handler that manages user subscriptions, storing data asynchronously in a PostgreSQL database via SQLx. It also integrates tracing for structured logging and telemetry, enabling real-time monitoring of application performance and subscription events."
  },
  {
    "name": "Rooster",
    "link": "https://github.com/0xfarco/rooster",
    "description": "A basic web server in Rust that listens for TCP connections, parses HTTP requests, and generates appropriate HTTP responses. The server uses a thread pool to handle multiple requests concurrently, improving throughput and performance."
  },
  {
    "name": "Chisel",
    "link": "https://github.com/0xfarco/chisel",
    "description": "Chisel is a simple C-based tool that automates video editing by reading a CHISEL file describing input videos and timestamped chunks. It uses FFmpeg to extract and concatenate these chunks into a final video"
  },
  {
    "name": "Shellium",
    "link": "https://github.com/0xfarco/shellium",
    "description": "A simple command-line shell implemented in C. It supports executing system commands, built-in commands such as `cd`, `help`, and `exit`, and provides basic process control through forking and waiting"
  },
  {
    "name": "Pica",
    "link": "https://github.com/0xfarco/pica",
    "description": "A simple image viewer application built with SDL2 and SDL2_image that displays images (PNG, JPG) and supports zooming via keyboard and mouse wheel"
  },
  {
    "name": "Shadex",
    "link": "https://github.com/0xfarco/shadex",
    "description": "A command-line tool written in C that converts input images into their nearest ANSI 256-color palette equivalents. The color matching can be performed in either the HSL or RGB color spaces"
  },
  {
    "name": "VirtuaLC3",
    "link": "https://github.com/0xfarco/virtualc3",
    "description": "A simple emulator for the LC-3 (Little Computer 3) virtual machine, implemented in C. It can load LC-3 binary images and execute them, supporting most of the LC-3 instruction set including traps, memory-mapped I/O, and keyboard input"
  },
  {
    "name": "Cadet",
    "link": "https://github.com/0xfarco/cadet",
    "description": "A simple text editor built in C that offers essential features such as file creation, editing, and saving with a minimalist interface"
  },
  {
    "name": "Zoomer",
    "link": "https://github.com/0xfarco/zoomer",
    "description": "Zoomer captures a screenshot of the entire desktop on an X11-based system (Linux) and displays it in a window using SDL2. It supports basic interactive zoom and pan functionality with the mouse and keyboard modifiers"
  },
  {
    "name": "Snortify",
    "link": "https://github.com/0xfarco/snortify",
    "description": "A simple interactive Bash script tool that helps you generate Snort IDS rules quickly and easily from the command line"
  },
  {
    "name": "Aestego",
    "link": "https://github.com/0xfarco/aestego",
    "description": "A tool for securely hiding AES-encrypted data in images using LSB steganography"
  },
  {
    "name": "Term256",
    "link": "https://github.com/0xfarco/term256",
    "description": "A terminal tool to display all 256 colors supported by modern terminals"
  }
]

